app/views/decisions/edit.html.erb

    <%= f.label :Scene_to_go_to %><br>
    <%= f.select :sceneToGoTO, options_for_select(@adventure.scenes.collect{ |u| [u.sceneName, u.id] }) %>
---
SELECT "scenes".* FROM "scenes" WHERE "scenes"."adventure_id" = ?  [["adventure_id", 7]]