app/views/player/sceneplayer.html.erb

SELECT "decisions".* FROM "decisions" WHERE "decisions"."scene_id" = ?  [["scene_id", 10]]
---
  <ul>
    <% @scene.decisions.each do |decision| %>