app/views/scenes/show.html.erb


  <% @scene.decisions.each do |decision| %>
---
SELECT "decisions".* FROM "decisions" WHERE "decisions"."scene_id" = ?  [["scene_id", 1]]