app/controllers/adventures_controller.rb

SELECT "adventures".* FROM "adventures"
---
  def index
    @adventures = Adventure.all

INSERT INTO "adventures" ("name", "description", "creator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test Adventure 1"], ["description", "An adventure of a lifetime"], ["creator", "Walker"], ["created_at", "2018-11-28 23:58:58.284288"], ["updated_at", "2018-11-28 23:58:58.284288"]]
---
  def create
      @adventure = Adventure.new(adventure_params)
      print "this is the chosen adventure:"
      print @adventure
      if(@adventure.save)

SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @adventure = Adventure.find(params[:id])

SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
      @adventure = Adventure.find(params[:id])

SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "adventures" SET "description" = ?, "updated_at" = ? WHERE "adventures"."id" = ?  [["description", "aa"], ["updated_at", "2018-12-13 03:12:18.598324"], ["id", 12]]
---
  def update
    @adventure = Adventure.find(params[:id])
    if(@adventure.update(adventure_params))

SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "adventures" WHERE "adventures"."id" = ?  [["id", 1]]
---
  def destroy
    print "--- delete adventure ---"
    @adventure = Adventure.find(params[:id])
    @adventure.destroy