app/controllers/decisions_controller.rb

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "scenes".* FROM "scenes" WHERE "scenes"."adventure_id" = ?  [["adventure_id", 6]]
---
  def new
    @scene = Scene.find(params[:scene_id])
    @adventure = Adventure.find(params[:adventure_id])
    @scenes = Scene.where(adventure_id: @adventure.id)

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "decisions" ("decisionDescription", "scene_id", "sceneToGoTO", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["decisionDescription", "This is the description of the decision"], ["scene_id", 1], ["sceneToGoTO", 1], ["created_at", "2018-11-28 23:51:11.241126"], ["updated_at", "2018-11-28 23:51:11.241126"]]
---
  def create
    @decision = Decision.new(decision_params)
    @scene = Scene.find(params[:scene_id])
    @decision = Decision.new(decisionDescription: @decision.decisionDescription, scene: @scene, sceneToGoTO: @decision.sceneToGoTO)

    print "this is the chosen decision scene:"
    print @decision.scene
    print "this is the chosen scene description:"
    print @decision.decisionDescription
    print "this is the chosen scene to go to"
    print @decision.sceneToGoTO
    if(@decision.save)

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 62], ["LIMIT", 1]]
SELECT  "decisions".* FROM "decisions" WHERE "decisions"."id" = ? LIMIT ?  [["id", 83], ["LIMIT", 1]]
DELETE FROM "decisions" WHERE "decisions"."id" = ?  [["id", 83]]
---
  def destroy
    print "--- delete decision ---"
    @scene = Scene.find(params[:scene_id])
    @decision = Decision.find(params[:id])
    @decision.destroy

SELECT  "decisions".* FROM "decisions" WHERE "decisions"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def edit
      @decision = Decision.find(params[:id])
      @scene = Scene.find(params[:scene_id])
      @adventure = Adventure.find(params[:adventure_id])

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]
SELECT  "decisions".* FROM "decisions" WHERE "decisions"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]
UPDATE "decisions" SET "decisionDescription" = ?, "sceneToGoTO" = ?, "updated_at" = ? WHERE "decisions"."id" = ?  [["decisionDescription", "are"], ["sceneToGoTO", 59], ["updated_at", "2018-12-13 03:33:02.712074"], ["id", 59]]
---
  def update
    @scene = Scene.find(params[:scene_id])
    @Decision = Decision.find(params[:decision_id])
    if(@Decision.update(decision_params))