app/controllers/player_controller.rb

SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."adventure_id" = ? ORDER BY "scenes"."id" ASC LIMIT ?  [["adventure_id", 4], ["LIMIT", 1]]
---
  def startadventure
    @adventure = Adventure.find(params[:adventure_id])
    @scene = Scene.where(adventure_id: @adventure.id).limit(1)[0]

SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def sceneplayer
    @adventure = Adventure.find(params[:adventure_id])
    @scene = Scene.find(params[:scene_id])