app/controllers/scenes_controller.rb

  def index
    @adventure = Adventure.find(params[:adventure_id])
    @scenes = Scene.where(adventure: {adventure_id: @adventure.id})
---
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "scenes".* FROM "scenes" WHERE "adventure"."adventure_id" = ?  [["adventure_id", 3]]

  def new
    @scene = Scene.new
    @adventure = Adventure.find(params[:adventure_id])
---
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
      @scene = Scene.new(scene_params)
      @adventure = Adventure.find(params[:adventure_id])

      @scene = Scene.new(adventure: @adventure, description: @scene.description, sceneName: @scene.sceneName)

      print "this is the chosen scene adventure:"
      print @scene.adventure
      print "this is the chosen scene description:"
      print @scene.description
      print "this is the chosen scene name:"
      print @scene.sceneName
      if(@scene.save)
---
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "scenes" ("sceneName", "description", "adventure_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sceneName", "asfasdfa"], ["description", "asfa"], ["adventure_id", 2], ["created_at", "2018-11-28 19:02:50.083438"], ["updated_at", "2018-11-28 19:02:50.083438"]]

  def show
    @scene = Scene.find(params[:id])
---
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def edit
      @scene = Scene.find(params[:id])
      @adventure = Adventure.find(params[:adventure_id])
---
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "adventures".* FROM "adventures" WHERE "adventures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    print "--- delete scene ---"
    @scene = Scene.find(params[:id])
    @scene.destroy
---
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 39], ["LIMIT", 1]]
DELETE FROM "scenes" WHERE "scenes"."id" = ?  [["id", 39]]